import React from 'react';

export const Twittermodal = () => {
    return (
        <div className="modal-wrapper" id="modal-01">
            <a href="#!" className="modal-overlay"></a>
            <div className="modal-window">
                <div className="modal-content">
                    <h4>テキストテキスト①</h4>
                    <p>
                        テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト<br />
                        テキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト<br />
                        テキストテキストテキストテキストテキストテキストテキストテキスト<br />
                        テキストテキストテキストテキストテキストテキストテキストテキスト<br />
                        テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト<br />
                        テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト<br />
                        テキストテキストテキストテキストテキストテキスト<br />
                        テキストテキストテキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキストテキスト<br />
                        テキスト
                                </p>
                </div>
                <a href="#!" className="modal-close">×</a>
            </div>
        </div>
    )
}